{
  "career": [
    {
      "name": "Resilience, Inc",
      "href": "https://www.mylearningtools.org/",
      "title": "Web Developer Intern",
      "logo": "/res.png",
      "start": "April 2025",
      "description": [
        "TBA"
      ]
    },
    {
      "name": "Panda Express",
      "href": "https://www.pandaexpress.com/",
      "title": "Shift Leader",
      "logo": "/pandaBear.png",
      "start": "May 2020",
      "description": [
        "Led a team of 8+ employees per shift, improving overall team performance and reducing training time for new hires by 25% through effective on-the-job coaching.",
        "Maintained a 95% customer satisfaction rate during shifts by resolving guests complaints quickly and ensuring high-quality service standards.",
        "Trained and developed 10+ new team members, helping them progress to lead roles within six months and increasing internal promotion rates."
      ]
    },
    {
      "name": "Old Dominion University",
      "href": "https://www.odu.edu",
      "title": "Computer Science Teaching Assisstant",
      "logo": "/odu.png",
      "start": "May 2022",
      "end": "December 2023",
      "description": [
        "Collaborated with course staff to redesign the course materials for the ‘Introduction to Programming with C++’ class, integrating new coding challenges and interactive activities that enhanced student engagement.",
        "Held weekly office TA hours and responded to student inquiries via email, addressing an average of ten questions per week, which improved assignment completion rates by 15%.",
        "Graded and provided constructive feedback on over 200 programming assignments, helping students improve their coding skills and debugging techniques.",
        "Assisted students in debugging code and troubleshooting technical issues during programming labs, reducing error rates by 30% and improving project submission timelines."
      ]
    },

    {
      "name": "Best Buy Geek Squad",
      "href": "https://www.bestbuy.com/",
      "title": "Geek Squad Advanced Repair Agent",
      "logo": "/geeksquad.png",
      "start": "August 2021",
      "end": "December 2023",
      "description": [
        "Troubleshot system failures and bugs and provided solutions to restore functionality, resolving 95% of cases on the first attempt, leading to a 20% increase in customer satisfaction.",
        "Reduced average repair time by 30% through streamlined troubleshooting processes, resulting in an increase in daily repair capacity.",
        "Trained and mentored five junior agents, improving team-wide repair accuracy by 15% and decreasing escalations by 25%.",
        "Increased service sales by 15% through targeted upselling of GeekSquad Protection plans and in-home services."
      ]
    }
  ]
}
