{
  "career": [
    {
      "name": "RecoveryTrek",
      "href": "https://recoverytrek.com",
      "title": "Junior Software Engineer",
      "logo": "/res.png",
      "start": "June 2025",
      "end": "Present",
      "description": [
        "Collaborated with cross-functional teams to maintain and support multiple healthcare organizations across the U.S. using the Salesforce platform and the PROOF application while developing new features for both web and mobile platforms.",
        "Developed backend services and APIs using Apex (Java), applying object-oriented programming principles to deliver scalable solutions.",
        "Built and optimized complex SQL queries for data processing, reporting, and system integrations to enhance application performance.",
        "Designed and implemented dynamic user interfaces with LWC framework (React) and automated workflows to improve system efficiency using agile development within a health tech environment."
      ]
    },
    {
      "name": "Altius",
      "href": "https://www.altiusinnovate.com",
      "title": "Software Engineer Intern",
      "logo": "/pandaBear.png",
      "start": "May 2025",
      "end": "August 2025",
      "description": [
        "Developed a scalable full stack application called “Charlie”, an AI chatbot that helped clients automate work including calendar appointments, emails, and reminders.",
        "Designed features using ReactJS for web, Python for backend services, and managed Firebase backend components.",
        "Participated in code reviews, debugging, and agile workflows while optimizing applications for performance and maintainability."
      ]
    },
    {
      "name": "Resilience, Inc",
      "href": "https://www.mylearningtools.org/",
      "title": "Web Developer Intern",
      "logo": "/res.png",
      "start": "April 2025",
      "description": [
        "Worked with the development team to build responsive web interfaces using HTML, CSS, and JavaScript.",
        "Developed internal tools, optimized SQL queries, and implemented backend functionality with PHP to improve site performance and usability."
      ]
    }
  ]
}
